app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."section_id" = ?  [["section_id", 1]]
---

        <% section.tasks.each do |task| %>