app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."section_id" IN (?, ?)  [["section_id", 1], ["section_id", 2]]
---
          <ul>
            <% section.tasks.each do |task| %>