app/controllers/home_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IS NULL AND "tasks"."section_id" IS NULL
---
  def index
    @tasks = Task.where(project_id: nil, section_id: nil)