app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @sections = @project.sections.includes(:tasks)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = ?  [["project_id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."section_id" IN (?, ?)  [["section_id", 1], ["section_id", 2]]

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Health and fitness"], ["description", "Workouts, diet and more"], ["created_at", "2025-05-20 11:01:57.168357"], ["updated_at", "2025-05-20 11:01:57.168357"]]

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Health anddddd fitness"], ["updated_at", "2025-05-23 11:26:15.871972"], ["id", 1]]