app/controllers/sections_controller.rb

  def create
    @project = Project.find(params[:project_id])
    @section = @project.sections.build(section_params)
    if @section.save
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sections" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Exercise"], ["project_id", 1], ["created_at", "2025-05-21 11:06:52.588572"], ["updated_at", "2025-05-21 11:06:52.588572"]]