app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "status", "due_date", "project_id", "section_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    if params[:section_id] && params[:project_id]
      @project = Project.find(params[:project_id])
      @section = Section.find(params[:section_id])
      @task = @section.tasks.build(task_params)
    else
      @task = Task.new(task_params)
    end

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", ""], ["status", "done"], ["updated_at", "2025-05-22 11:43:01.510765"], ["id", 15]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)